{"article_title": "Tayshaun Prince", "Stats": {"number_entities": 3, "number_potential_entities": 7, "number_inferences": 2}, "Links": [{"linked": "p1$", "prelinked": ["pA$", "pC$", "pD$"]}, {"linked": "p2$", "prelinked": ["pB$", "pE$"]}, {"linked": "p3$", "prelinked": ["pF$", "pG$"]}], "Hierarchy": [{"fragments": [{"fragments": [], "rep": "p1$.name = Ryan", "sentence": "Ryan"}, {"fragments": [], "rep": "that$:rang = this$", "sentence": "That rang this"}, {"fragments": [], "rep": "p2$ | p1$.wife = p2$, p1$.ppro = his", "sentence": "his wife"}], "sentence": "Ryan rang his wife"}], "article_sections": [{"section_number": 0, "section_text": "Tayshaun Durell Prince (born February 28, 1980) is an American professional basketball player who currently plays for the Detroit Pistons of the National Basketball Association (NBA). The 6'9\" small forward graduated from Dominguez High School before playing college basketball for the University of Kentucky. He was drafted 23rd overall by the Detroit Pistons in the 2002 NBA draft and went on to win a championship with the team in 2004.\n\n", "section_name": "first paragraph", "sentences": ["Tayshaun Durell Prince (born February 28, 1980) is an American professional basketball player who currently plays for the Detroit Pistons of the National Basketball Association (NBA)", "The 6'9\" small forward graduated from Dominguez High School before playing college basketball for the University of Kentucky", "He was drafted 23rd overall by the Detroit Pistons in the 2002 NBA draft and went on to win a championship with the team in 2004"]}, {"section_number": 1, "section_text": "Prince played four seasons (1998 to 2002) for the University of Kentucky Wildcats, averaging 13.2 points and 5.7 rebounds as the Wildcats posted a 97–39 record and advanced to the NCAA Tournament each year. The furthest the Wildcats made in the tournament was the regional finals, losing to the Michigan State Spartans. Prince won SEC Player of the Year in his junior season (2000–2001) – also leading the SEC in free throw percentage (84.3%) – and was named to the Associated Press All-SEC Teams in both his junior and senior years. Kentucky won the SEC Tournament in 1999 and 2001, and Prince was awarded the 2001 tournament's Most Valuable Player award. He was a three-time team MVP with the Wildcats.\nNotable individual performances included a 31 point, 11 rebound, four assist, four steal effort in a 79–59 victory over North Carolina. In scoring Kentucky's first fifteen points, Prince made five consecutive three-point shots. Kentucky shooting guard Keith Bogans compared Prince's performance to \"the Chicago Bulls' Michael Jordan blistering Portland in the 1992 NBA Finals.\" In an 87–82 victory over Tulsa during the 2002 NCAA Tournament, Prince scored a career-high 41 points (along with nine rebounds, four assists and three blocks) to lead Kentucky to the Sweet 16. He graduated from Kentucky in 2002 with a degree in sociology.\n", "section_name": "College career", "sentences": ["Prince played four seasons (1998 to 2002) for the University of Kentucky Wildcats, averaging 13.2 points and 5.7 rebounds as the Wildcats posted a 97–39 record and advanced to the NCAA Tournament each year", "The furthest the Wildcats made in the tournament was the regional finals, losing to the Michigan State Spartans", "Prince won SEC Player of the Year in his junior season (2000–2001) – also leading the SEC in free throw percentage (84.3%) – and was named to the Associated Press All-SEC Teams in both his junior and senior years", "Kentucky won the SEC Tournament in 1999 and 2001, and Prince was awarded the 2001 tournament's Most Valuable Player award", "He was a three-time team MVP with the Wildcats", "Notable individual performances included a 31 point, 11 rebound, four assist, four steal effort in a 79–59 victory over North Carolina", "In scoring Kentucky's first fifteen points, Prince made five consecutive three-point shots", "Kentucky shooting guard Keith Bogans compared Prince's performance to \"the Chicago Bulls' Michael Jordan blistering Portland in the 1992 NBA Finals.\"", "In an 87–82 victory over Tulsa during the 2002 NCAA Tournament, Prince scored a career-high 41 points (along with nine rebounds, four assists and three blocks) to lead Kentucky to the Sweet 16", "He graduated from Kentucky in 2002 with a degree in sociology"]}, {"section_number": 2, "section_text": "\nSEC Player of the Year (2001)\nConsensus second team All-American (2001)\nNABC All-American Second Team (2002)\nAP All-American Third Team (2002)\nFirst Team All-SEC (2001, 2002)\nSEC Tournament MVP (2001)\nSEC All-Tournament Team (2001)\n\n", "section_name": "College Awards & Honors", "sentences": ["SEC Player of the Year (2001)", "Consensus second team All-American (2001)", "NABC All-American Second Team (2002)", "AP All-American Third Team (2002)", "First Team All-SEC (2001, 2002)", "SEC Tournament MVP (2001)", "SEC All-Tournament Team (2001)"]}, {"section_number": 3, "section_text": "", "section_name": "NBA career", "sentences": []}, {"section_number": 4, "section_text": "", "section_name": "Detroit Pistons", "sentences": []}, {"section_number": 5, "section_text": "In his rookie season under head coach Rick Carlisle, Prince was not a member of the team's playing rotation and appeared in just 42 of 82 regular-season games. However, in the first round of the 2003 NBA Playoffs, Detroit trailed the Orlando Magic three games to one, forcing Carlisle to experiment with a different rotation. Prince was inserted into the lineup and received heavy minutes. He then became the only player in NBA history to score more points in the playoffs than in the regular season (137 in the season, 141 in the playoffs).\nThe Pistons rallied to win the series, and Prince had a breakout performance during the decisive seventh game, scoring 20 points in 24 minutes. In the second round against the Philadelphia 76ers, Prince continued to see action and made several memorable plays, including a turnaround hook shot during the final seconds of Game 2, forcing an overtime period that the Pistons went on to win.\n", "section_name": "Rookie year", "sentences": ["In his rookie season under head coach Rick Carlisle, Prince was not a member of the team's playing rotation and appeared in just 42 of 82 regular-season games", "However, in the first round of the 2003 NBA Playoffs, Detroit trailed the Orlando Magic three games to one, forcing Carlisle to experiment with a different rotation", "Prince was inserted into the lineup and received heavy minutes", "He then became the only player in NBA history to score more points in the playoffs than in the regular season (137 in the season, 141 in the playoffs)", "The Pistons rallied to win the series, and Prince had a breakout performance during the decisive seventh game, scoring 20 points in 24 minutes", "In the second round against the Philadelphia 76ers, Prince continued to see action and made several memorable plays, including a turnaround hook shot during the final seconds of Game 2, forcing an overtime period that the Pistons went on to win"]}, {"section_number": 6, "section_text": "After the Pistons were swept by the New Jersey Nets in the Eastern Conference Finals, Carlisle was fired and former Sixers coach Larry Brown took over as head coach. Under Brown, Prince became the Pistons' starting small forward and increased his scoring average to 10.3 points per game, up from 3.3 as a rookie. In that 2003–04 season, Prince was also selected to play for the Sophomores (second-year players) in the NBA Rookie Challenge.\n\"The Block\"[edit]\nIn Game 2 of the 2004 Eastern Conference Finals against the Indiana Pacers, Prince made a memorable defensive play. In the final minute of the game, Pacer star shooting guard Reggie Miller took an outlet pass after an Indiana steal and sprinted up the right sideline for a seemingly uncontested basket that would have tied the score. Prince pursued from the left sideline. Miller, presumably thinking that Prince could not catch him, attempted a layup. At the last possible moment, Prince soared in from the other side of the basket and swatted the ball away; the ball landed in bounds and was scooped up by Pistons teammate Richard Hamilton, effectively ending the game. The Pistons went on to win the series and, eventually, the NBA championship. When the Pistons defeated the Los Angeles Lakers four games to one in the NBA Finals, Prince's tough defense on Lakers guard Kobe Bryant was credited as a key factor in the Pistons' victory, holding Bryant to only 11 points in an 88–68 win in Game 3 of the 2004 NBA Finals.\n", "section_name": "2003–04 season", "sentences": ["After the Pistons were swept by the New Jersey Nets in the Eastern Conference Finals, Carlisle was fired and former Sixers coach Larry Brown took over as head coach", "Under Brown, Prince became the Pistons' starting small forward and increased his scoring average to 10.3 points per game, up from 3.3 as a rookie", "In that 2003–04 season, Prince was also selected to play for the Sophomores (second-year players) in the NBA Rookie Challenge", "\"The Block\"[edit]", "In Game 2 of the 2004 Eastern Conference Finals against the Indiana Pacers, Prince made a memorable defensive play", "In the final minute of the game, Pacer star shooting guard Reggie Miller took an outlet pass after an Indiana steal and sprinted up the right sideline for a seemingly uncontested basket that would have tied the score", "Prince pursued from the left sideline", "Miller, presumably thinking that Prince could not catch him, attempted a layup", "At the last possible moment, Prince soared in from the other side of the basket and swatted the ball away; the ball landed in bounds and was scooped up by Pistons teammate Richard Hamilton, effectively ending the game", "The Pistons went on to win the series and, eventually, the NBA championship", "When the Pistons defeated the Los Angeles Lakers four games to one in the NBA Finals, Prince's tough defense on Lakers guard Kobe Bryant was credited as a key factor in the Pistons' victory, holding Bryant to only 11 points in an 88–68 win in Game 3 of the 2004 NBA Finals"]}, {"section_number": 7, "section_text": "In Game 2 of the 2004 Eastern Conference Finals against the Indiana Pacers, Prince made a memorable defensive play. In the final minute of the game, Pacer star shooting guard Reggie Miller took an outlet pass after an Indiana steal and sprinted up the right sideline for a seemingly uncontested basket that would have tied the score. Prince pursued from the left sideline. Miller, presumably thinking that Prince could not catch him, attempted a layup. At the last possible moment, Prince soared in from the other side of the basket and swatted the ball away; the ball landed in bounds and was scooped up by Pistons teammate Richard Hamilton, effectively ending the game. The Pistons went on to win the series and, eventually, the NBA championship. When the Pistons defeated the Los Angeles Lakers four games to one in the NBA Finals, Prince's tough defense on Lakers guard Kobe Bryant was credited as a key factor in the Pistons' victory, holding Bryant to only 11 points in an 88–68 win in Game 3 of the 2004 NBA Finals.\n", "section_name": "\"The Block\"", "sentences": ["In Game 2 of the 2004 Eastern Conference Finals against the Indiana Pacers, Prince made a memorable defensive play", "In the final minute of the game, Pacer star shooting guard Reggie Miller took an outlet pass after an Indiana steal and sprinted up the right sideline for a seemingly uncontested basket that would have tied the score", "Prince pursued from the left sideline", "Miller, presumably thinking that Prince could not catch him, attempted a layup", "At the last possible moment, Prince soared in from the other side of the basket and swatted the ball away; the ball landed in bounds and was scooped up by Pistons teammate Richard Hamilton, effectively ending the game", "The Pistons went on to win the series and, eventually, the NBA championship", "When the Pistons defeated the Los Angeles Lakers four games to one in the NBA Finals, Prince's tough defense on Lakers guard Kobe Bryant was credited as a key factor in the Pistons' victory, holding Bryant to only 11 points in an 88–68 win in Game 3 of the 2004 NBA Finals"]}, {"section_number": 8, "section_text": "Prince continued to show improvement in the 2004–05 season, setting career highs in scoring (14.7 points per game), rebounding (5.3 per game), assists (3.0) and blocks (0.9). He was selected for the NBA's All-Defensive Second Team and was a candidate for the NBA Most Improved Player Award, where he came in third behind winner Bobby Simmons of the Los Angeles Clippers and Primož Brezec of the Charlotte Bobcats. Although he and the Pistons made it back to the NBA Finals in 2005, they lost to the San Antonio Spurs in seven games.\nPrince's play was rewarded by the Pistons with a five-year contract extension worth $49 million on October 31, 2005.\n", "section_name": "2004–05 season", "sentences": ["Prince continued to show improvement in the 2004–05 season, setting career highs in scoring (14.7 points per game), rebounding (5.3 per game), assists (3.0) and blocks (0.9)", "He was selected for the NBA's All-Defensive Second Team and was a candidate for the NBA Most Improved Player Award, where he came in third behind winner Bobby Simmons of the Los Angeles Clippers and Primož Brezec of the Charlotte Bobcats", "Although he and the Pistons made it back to the NBA Finals in 2005, they lost to the San Antonio Spurs in seven games", "Prince's play was rewarded by the Pistons with a five-year contract extension worth $49 million on October 31, 2005"]}, {"section_number": 9, "section_text": "In the 2005–06 season, Prince played in all 82 regular season games, averaging 14.1 points and 4.2 rebounds a game. In the playoffs, the Pistons were eliminated by the Miami Heat in the Eastern Conference Finals.\n", "section_name": "2005–06 season", "sentences": ["In the 2005–06 season, Prince played in all 82 regular season games, averaging 14.1 points and 4.2 rebounds a game", "In the playoffs, the Pistons were eliminated by the Miami Heat in the Eastern Conference Finals"]}, {"section_number": 10, "section_text": "In the 2006–07 season, Prince returned similar statistics to his 2004–05 campaign: 14.3 points, 5.2 rebounds, and 2.8 assists per game. In the playoffs the Pistons were eliminated in the Eastern Conference Finals by the Cleveland Cavaliers in six games.\n", "section_name": "2006–07 season", "sentences": ["In the 2006–07 season, Prince returned similar statistics to his 2004–05 campaign: 14.3 points, 5.2 rebounds, and 2.8 assists per game", "In the playoffs the Pistons were eliminated in the Eastern Conference Finals by the Cleveland Cavaliers in six games"]}, {"section_number": 11, "section_text": "In the 2007–08 season, Prince played and started in all 82 regular season games, averaging 13.2 points, 4.9 rebounds, and 3.3 assists per game. In the playoffs, Prince averaged 13.8 points, 5.5 rebounds, and 3.2 assists, but the Pistons were eliminated in the Eastern Conference Finals by the Boston Celtics in game six.\n", "section_name": "2007–08 season", "sentences": ["In the 2007–08 season, Prince played and started in all 82 regular season games, averaging 13.2 points, 4.9 rebounds, and 3.3 assists per game", "In the playoffs, Prince averaged 13.8 points, 5.5 rebounds, and 3.2 assists, but the Pistons were eliminated in the Eastern Conference Finals by the Boston Celtics in game six"]}, {"section_number": 12, "section_text": "Prince started the season off strong while averaging nearly 16 points and seven rebounds a game. As the season started to progress Prince's production started to slump and by the end of the season he averaged 14.2 points and 5.8 rebounds. Although his points per game average dropped, he averaged a career high in rebounds per game. Prince's effort helped push the Pistons to the playoffs as they gained the 8th seed with 39 wins. Although the Pistons made the playoffs, they were seeded against the top seed Cleveland Cavaliers. The Cavaliers swept the Pistons in four games, and Prince's production from the season dropped drastically, as he averaged only 3.8 points and 3.5 rebounds.\n", "section_name": "2008–09 season", "sentences": ["Prince started the season off strong while averaging nearly 16 points and seven rebounds a game", "As the season started to progress Prince's production started to slump and by the end of the season he averaged 14.2 points and 5.8 rebounds", "Although his points per game average dropped, he averaged a career high in rebounds per game", "Prince's effort helped push the Pistons to the playoffs as they gained the 8th seed with 39 wins", "Although the Pistons made the playoffs, they were seeded against the top seed Cleveland Cavaliers", "The Cavaliers swept the Pistons in four games, and Prince's production from the season dropped drastically, as he averaged only 3.8 points and 3.5 rebounds"]}, {"section_number": 13, "section_text": "On January 30, 2013, Prince and Austin Daye were traded to the Memphis Grizzlies in a three-team trade which sent Rudy Gay and Hamed Haddadi to the Toronto Raptors and Jose Calderon to the Pistons. The Grizzlies also received Ed Davis.\nDespite an injury sustained in pre-season, Prince still managed to play 76 games in 2013–14, averaging 6.0 points, 3.1 rebounds and 1.6 assists per game – the second lowest stat line of his career behind his rookie season. His 29% from the three-point line was also a career low.\n", "section_name": "Memphis Grizzlies", "sentences": ["On January 30, 2013, Prince and Austin Daye were traded to the Memphis Grizzlies in a three-team trade which sent Rudy Gay and Hamed Haddadi to the Toronto Raptors and Jose Calderon to the Pistons", "The Grizzlies also received Ed Davis", "Despite an injury sustained in pre-season, Prince still managed to play 76 games in 2013–14, averaging 6.0 points, 3.1 rebounds and 1.6 assists per game – the second lowest stat line of his career behind his rookie season", "His 29% from the three-point line was also a career low"]}, {"section_number": 14, "section_text": "On January 12, 2015, Prince was traded to the Boston Celtics in a three-team deal involving the Grizzlies and the New Orleans Pelicans. On January 26, he made his debut for the Celtics, and in 30 minutes of action off the bench, he recorded 19 points and 5 assists to lead the Celtics to a 99-90 win over the Utah Jazz.\n", "section_name": "Boston Celtics", "sentences": ["On January 12, 2015, Prince was traded to the Boston Celtics in a three-team deal involving the Grizzlies and the New Orleans Pelicans", "On January 26, he made his debut for the Celtics, and in 30 minutes of action off the bench, he recorded 19 points and 5 assists to lead the Celtics to a 99-90 win over the Utah Jazz"]}, {"section_number": 15, "section_text": "On February 19, 2015, Prince was traded back to the Pistons in exchange for Luigi Datome and Jonas Jerebko.\n", "section_name": "Return to Detroit", "sentences": ["On February 19, 2015, Prince was traded back to the Pistons in exchange for Luigi Datome and Jonas Jerebko"]}, {"section_number": 16, "section_text": "On August 20, 2007, Prince was selected to be a part of Team USA that competed at the 2007 FIBA Americas Championship, a qualifying tournament for the Beijing Olympics. With his defensive poise, he contributed in the USA's unbeaten record at the tournament held in Las Vegas, Nevada and earn a spot at the 2008 Summer Olympics.\nOn June 23, 2008, Prince was selected for the Olympic squad along with eleven others in the hope of fulfilling the ambition of winning their first gold medal since the 2000 Summer Olympics. Team USA went on to do exactly that, going unbeaten in the tournament with Prince coming off the bench and defeating 2006 World Champion Spain in the final, living up to their \"Redeem Team\" moniker.\n", "section_name": "International career", "sentences": ["On August 20, 2007, Prince was selected to be a part of Team USA that competed at the 2007 FIBA Americas Championship, a qualifying tournament for the Beijing Olympics", "With his defensive poise, he contributed in the USA's unbeaten record at the tournament held in Las Vegas, Nevada and earn a spot at the 2008 Summer Olympics", "On June 23, 2008, Prince was selected for the Olympic squad along with eleven others in the hope of fulfilling the ambition of winning their first gold medal since the 2000 Summer Olympics", "Team USA went on to do exactly that, going unbeaten in the tournament with Prince coming off the bench and defeating 2006 World Champion Spain in the final, living up to their \"Redeem Team\" moniker"]}, {"section_number": 17, "section_text": "\n2004 NBA champion\n2004–05 NBA All-Defensive Second Team\n2005–06 NBA All-Defensive Second Team\n2006–07 NBA All-Defensive Second Team\n2007–08 NBA All-Defensive Second Team\nGold Medal with Team USA, 2007 Tournament of Americas Olympic Qualifiers\nGold Medal with Team USA, 2008 Summer Olympics\n\n", "section_name": "Honors/achievements", "sentences": ["2004 NBA champion", "2004–05 NBA All-Defensive Second Team", "2005–06 NBA All-Defensive Second Team", "2006–07 NBA All-Defensive Second Team", "2007–08 NBA All-Defensive Second Team", "Gold Medal with Team USA, 2007 Tournament of Americas Olympic Qualifiers", "Gold Medal with Team USA, 2008 Summer Olympics"]}, {"section_number": 18, "section_text": "", "section_name": "NBA career statistics", "sentences": []}, {"section_number": 19, "section_text": "", "section_name": "Regular season", "sentences": []}, {"section_number": 20, "section_text": "", "section_name": "Playoffs", "sentences": []}], "Summary": "Tayshaun Durell Prince (born February 28, 1980) is an American professional basketball player who currently plays for the Detroit Pistons of the National Basketball Association (NBA)", "source": "www.wikipedia.org", "Inferences": [{"inference": "p1$:recovered", "clues": [12, 17]}, {"inference": "p2$:saw = o1$", "clues": [9, 15, 16]}]}