{"article_title": "The Axe Gang", "Stats": {"number_entities": 3, "number_potential_entities": 7, "number_inferences": 2}, "Links": [{"linked": "p1$", "prelinked": ["pA$", "pC$", "pD$"]}, {"linked": "p2$", "prelinked": ["pB$", "pE$"]}, {"linked": "p3$", "prelinked": ["pF$", "pG$"]}], "Hierarchy": [{"fragments": [{"fragments": [], "rep": "p1$.name = Ryan", "sentence": "Ryan"}, {"fragments": [], "rep": "that$:rang = this$", "sentence": "That rang this"}, {"fragments": [], "rep": "p2$ | p1$.wife = p2$, p1$.ppro = his", "sentence": "his wife"}], "sentence": "Ryan rang his wife"}], "article_sections": [{"section_number": 0, "section_text": "The Axe Gang (Simplified Chinese: 斧头帮 fǔ tóu bāng; Traditional Chinese: 斧頭幫, Bopomofo: ㄈㄨˇ ㄊㄡˊ ㄅㄤˉ) is a reference to a gang founded in 1921, but is currently used for show in cinema. It has appeared in a few Hong Kong martial arts films, the most recent being the Hong Kong film Ip Man.\nThe fictional version of the Axe Gang is based on a real-life Axe Gang in Shanghai around Japanese Occupation with a leader named Wang Ya Qiao.\n\n", "section_name": "first paragraph", "sentences": ["The Axe Gang (Simplified Chinese: 斧头帮 fǔ tóu bāng; Traditional Chinese: 斧頭幫, Bopomofo: ㄈㄨˇ ㄊㄡˊ ㄅㄤˉ) is a reference to a gang founded in 1921, but is currently used for show in cinema", "It has appeared in a few Hong Kong martial arts films, the most recent being the Hong Kong film Ip Man", "The fictional version of the Axe Gang is based on a real-life Axe Gang in Shanghai around Japanese Occupation with a leader named Wang Ya Qiao"]}, {"section_number": 1, "section_text": "The Axe Gang has control over Shanghai and uses axes as a weapon of choice, usually dressed in black suits and sometimes top hats. Boxer From Shantung is perhaps the gang's earliest appearance, though they are not formally called Axe Gang within the film. The Gang also appears in Project A Part II, Drunken Master II, Marrying the Mafia II, Kung Fu Hustle, and Shanghai Affairs.\n", "section_name": "Background", "sentences": ["The Axe Gang has control over Shanghai and uses axes as a weapon of choice, usually dressed in black suits and sometimes top hats", "Boxer From Shantung is perhaps the gang's earliest appearance, though they are not formally called Axe Gang within the film", "The Gang also appears in Project A Part II, Drunken Master II, Marrying the Mafia II, Kung Fu Hustle, and Shanghai Affairs"]}, {"section_number": 2, "section_text": "In the martial-arts film Kung Fu Hustle, the Axe Gang is run in a way very similar to the Italian crime mafia families or perhaps to the major Chinese Triads. The Axe Gang is led by Brother Sum. Two crossed axes forming an \"X\" can be seen as their recognizable logo in Kung Fu Hustle, which many if not all members have tattooed on their bodies somewhere, visible or otherwise. The gang is shown doing dance moves in Kung Fu Hustle reminiscent of 50s musicals.\n", "section_name": "In Kung Fu Hustle", "sentences": ["In the martial-arts film Kung Fu Hustle, the Axe Gang is run in a way very similar to the Italian crime mafia families or perhaps to the major Chinese Triads", "The Axe Gang is led by Brother Sum", "Two crossed axes forming an \"X\" can be seen as their recognizable logo in Kung Fu Hustle, which many if not all members have tattooed on their bodies somewhere, visible or otherwise", "The gang is shown doing dance moves in Kung Fu Hustle reminiscent of 50s musicals"]}, {"section_number": 3, "section_text": "\nBoxer From Shantung (1972)\nProject A Part II (1987)\n\n\nDrunken Master II (1994)\nFist of Fury (1995)\nShanghai Affairs (1998)\nKung Fu Hustle (2004)\nMarrying the Mafia II (2005)\nIp Man (2008)\n\n", "section_name": "Films", "sentences": ["Boxer From Shantung (1972)", "Project A Part II (1987)", "Drunken Master II (1994)", "Fist of Fury (1995)", "Shanghai Affairs (1998)", "Kung Fu Hustle (2004)", "Marrying the Mafia II (2005)", "Ip Man (2008)"]}], "Summary": "The Axe Gang (Simplified Chinese: 斧头帮 fǔ tóu bāng; Traditional Chinese: 斧頭幫, Bopomofo: ㄈㄨˇ ㄊㄡˊ ㄅㄤˉ) is a reference to a gang founded in 1921, but is currently used for show in cinema", "source": "www.wikipedia.org", "Inferences": [{"inference": "p1$:recovered", "clues": [12, 17]}, {"inference": "p2$:saw = o1$", "clues": [9, 15, 16]}]}